tutorials/cases/prescribedUsCases/vortexSolidBody/constant/reactions
species
(
    N2
);

reactions
{
}
