tutorials/cases/prescribedUsCases/vortexSolidBody/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  v2406
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Plants the solid blob (porosityF < 1 => solid mass present) off-centre.
// The Us field is set afterwards by setExprFields (see setExprFieldsDict), so
// here Us defaults to zero and no Us regions are specified.

defaultFieldValues
(
    volScalarFieldValue porosityF  0.999
    volScalarFieldValue porosityF0 0.999
    volVectorFieldValue Us         (0 0 0)
);

regions
(
    // Solid blob: radius 3 mm cylinder about z, off-centre at (0.01, 0.015).
    cylinderToCell
    {
        point1  (0.01 0.015 -1);
        point2  (0.01 0.015  1);
        radius  0.003;
        fieldValues
        (
            volScalarFieldValue porosityF  0.99
            volScalarFieldValue porosityF0 0.99
        );
    }
);

// ************************************************************************* //
